{"Employment": [], "Housing": [], "Food": [], "Financial": [["Through further conversation, SW discovered that this FA appointment will be the apply the family for Masshealth (Massuchusetts Medicaid). SW discussed that while this will be needed, we will need to set the family up more immediately with Charity Care, as they will be uninsured awaiting the transfer to NJ MA to MA MA. BMC FA discussed that they do not do Charity Care, and that SW will need to call BMC Pediatrics Department (617-414-5086) and request to speak with a SW there to complete the Charity Care Application.", "social need"], ["Patient screened today for concrete resource eligibility: Patient is eligible and Social Work provided the following resources:  Meal Vouchers: 3 and Other: Lyft. Reason for Disbursement: Other hardship considerations: No Financial Resources", "social need"], ["SW also approved meal vouchers for today and tomorrow for Dad when he is at the bedside.", "social need"], ["SW to get in touch with BMC SW (Pediatrics: 617-414-5086) regarding setting up Charity Care for Esther (SW awaiting BMC SW callback) [ ] Dad to register himself with BMC, so he can apply for Financial Assistance for Esther [ ] SW to schedule an appointment with BMC Financial Assistance (617-414-5155) once Dad is registered with BMC", "social need"], ["SW will speak with BMC SW regarding getting the family set up with Charity Care. SW will inform Dad that he will need to register himself with BMC. SW will then help Dad schedule an appointment with BMC MA next week. MD working on setting up PCP appointment with the understanding that FA Appointment is in place and hopefully Charity Care applied for.", "social need"]], "Transportation": [["Progress: CFF confirmed that Dad successfully got onto the Lyft this morning to the Boston Greyhound Bus Station.", "social need"], ["SW discussed that SW will be approved a Lyft ride from the Greyhound Station to CHOP.", "social need"], ["Patient screened today for concrete resource eligibility: Patient is eligible and Social Work provided the following resources:  Meal Vouchers: 3 and Other: Lyft. Reason for Disbursement: Other hardship considerations: No Financial Resources Additional comments: SW approved Lyft ride for the family from Philadelphia Greyhound Station to CHOP when Dad arrives at 5:15pm.", "social need"], ["SW to approve Lyft from from Greyhound Station to CHOP.", "social need"]], "Childcare": [], "SubstanceAbuse": [], "Safety": [["SW received call from DCPP caseworker (609-626-3200) who informed SW that she is going to put in a request to transfer the case to Boston.", "social need"]], "Permanency": []}