{"Employment": [], "Housing": [["Mother inquired about eligibility for Ronald McDonald House due to MGM's childcare barriers. SW explained that, generally, families with CYS involvement are not eligible. However, SW contacted RMH to discuss and inquire. RMH leadership to discuss a potential exception and contact SW with decision.", "social need"], ["Mother confirmed that she plans to return to Vantage House upon discharge and patient will join her there if custody is returned.", "social need"]], "Food": [], "Financial": [], "Transportation": [["Patient should be eligible for MATP. Lancaster County MATP is Red Rose Transit Authority (717-291-1243). SW spoke with MATP and confirmed they do transport patient's to/from Philadelphia, but only on Tuesdays/Thursdays. They also require two days' notice. SW provided Mother with paperwork to review and complete. The application for MATP required Access Card information and Mirajh's social security number, which Mother did not have available. She plans to seek this information and fill out remainder of application.", "social need"], ["Problems: Hospital discharge, Transportation and Other:  Childcare", "social need"]], "Childcare": [], "SubstanceAbuse": [], "Safety": [["Mother stated that MGM has patient's car seat and can bring it to the hospital closer to discharge.", "no social need"], ["Other:  CYS involvement/disposition", "social need"], ["Mother expressed frustrations about her experience with CYS. SW provided supportive counseling. Mother stated that she wishes to wait until after the next court hearing to proceed with training. Regardless of outcome, both Mother and MGM plan to participate in care and be trained.", "social need"]], "Permanency": [["Mother confirmed that she plans to return to Vantage House upon discharge and patient will join her there if custody is returned.", "social need"], ["Awaiting outcome of Monday 2/6 court hearing to confirm disposition, then team/family will proceed with training and additional discharge planning.", "social need"], ["Mother stated that she wishes to wait until after the next court hearing to proceed with training. Regardless of outcome, both Mother and MGM plan to participate in care and be trained.", "social need"]]}