{"Employment": [], "Housing": [], "Food": [], "Financial": [["Dad shared that he continues to work on the ODF application. SW reminded Dad to inform SW when the application is complete so SW can sign and submit the application.", "social need"], ["SW assessed for and approved meal vouchers for Dad this weekend when he is at the bedside completing caregiver training. Transportation has been a significant financial strain this admission. Patient screened today for concrete resource eligibility: Patient is eligible and Social Work provided the following resources:  Meal Vouchers: 4. Reason for Disbursement: Unforseen/emergent admission-no available resources Additional comments: SW approved meal vouchers for Dad this weekend for when he is here for caregiver training due to significant financial strain from this admission. Dad aware he can pick up vouchers at the Welcome Desk in the Main Lobby.", "social need"]], "Transportation": [["Dad shared that these letters are to assist Mom with her hearing with the Embassy on May 24th in which she is requesting to come to the US to be with Sameer and help with his care. SW and Dad discussed an additional letter being provided that outlines Sameer's diagnoses and care to demonstrate the benefit of having his Mother here with him. SW collaborated with FLOC to complete this letter and emailed it to Dad", "social need"], ["Dad relayed that the earliest train that leaves Newark on Saturday is at 4am and he will not arrive at CHOP until 9/9:30am.", "social need"], ["Dad relayed that the earliest train that leaves Newark on Saturday is at 4am and he will not arrive at CHOP until 9/9:30am.", "social need"], ["Dad confirmed he already spoke with insurance that they would need Dad to provide the address and mileage to request an exception from Insurance to cover this trip. SW discussed that there is also a Closest Provider Form that MD will complete to share the necessity of follow up at CHOP.", "social need"], ["SW also discussed ModivCare. Dad confirmed that Sameer is registered and utilizes this resource to get to all Outpatient Appointments. Dad confirmed he already spoke with insurance that they would need Dad to provide the address and mileage to request an exception from Insurance to cover this trip. SW discussed that there is also a Closest Provider Form that MD will complete to share the necessity of follow up at CHOP", "social need"], ["Resource Needs - Intervention - Adequate transportation: • Explore existing transportation options (family, community-based and/or insurance resources) • Refer as needed to insurance or community-based resources • Assess patient's transportation needs related to accessing medical care", "social need"]], "Childcare": [], "SubstanceAbuse": [], "Safety": [], "Permanency": []}