{"Employment": [["Mom had previously worked (for 23 years), but her job got interrupted during COVID. Mom has been unable to work since due to her health.", "social need"]], "Housing": [["Housing instability YES Housing instability comment: Mom is looking to move due to ongoing issues with mice in her home and needing a more appropriate space for her and Yaribeth. Mom is actively looking, PICU SW provided housing resources.", "social need"], ["Parent Stressors Mom's health, current housing situation, signficant financial strain, getting access to public benefits", "social need"], ["Goal - Housing Family will have needed supports to identify safe housing. Intervention/Plan- Housing PICU SW provided housing resources. Mom is actively looking for housing and will keep SW updated with progress and if any additional resources are needed.", "social need"], ["Mom looking into identifying new housing due to ongoing issues with mice and wanting a more appropriate space for her and Yaribeth. Mom confirmed that her landlord is aware and active in supporting the pest issue and has another exterminator coming out today, but the problem has been persistent over time.", "social need"]], "Food": [["Food insecurity YES Food insecurity comment: Mom applied for EBT and got one payment, and has not received anything since then. Mom attempted to go to the CAO today, but they advised her that she needed to complete a form, but she was unable to complete this without assistance and they denied her assistance. SW to troubleshoot this with Mom. Mom has limited access to food.", "social need"], ["Goal - Access to food Mom will have access to food during this admission. Intervention/Plan - Access to food SW will continue to reassess for concrete resources during this admission. SW to assist Mom with obtaining SNAP benefits and will provide information regarding local food pantries.", "social need"]], "Financial": [["Parent Stressors Mom's health, current housing situation, signficant financial strain, getting access to public benefits", "social need"], ["Resource Needs Problem: HOUSEHOLD FINANCES;ACCESS TO FOOD;EMPLOYMENT/INCOME;HOUSING Goal - Household Finances Family will receive support with household finances this admission. Intervention/Plan - Household Finances SW will continue to assess and explore avenues to assist the family financially this admission. SW to apply to ODF, as Mom confirmed she has a landlord and access to the needed documentation for the application. SW to look into other organizations,", "social need"], ["Goal - Employment/income Mom will have the needed supports to apply for SSI for herself. Intervention/Plan - Employment/income SW will provide Mom with support in applying for SSI so that the family can have monthly income.", "social need"], ["Mom shared her ongoing challenges with getting public benefits- SSI for herself and SNAP. Mom shared that she went to the CAO today and was told that she needs to complete a W2 form in order to complete the application. Mom requested assistance with completing the form due to her visual disabilities, but was denied assistance. Mom shared that they offered to email her the form, but she didn't have access to a computer or printer. SW offered for Mom to provide this SW email address and SW can print off the application and assist Mom with completing it. Mom in agreement with this plan and will return to the CAO and keep SW updated.", "social need"], ["Mom also clarified that she has a landlord and pays $1,025/month in rent. SW discussed ODF and Mom is interested in applying.", "social need"], ["Mom confirmed she has already paid April rent.", "no social need"], ["The rental grant would be for May.", "social need"]], "Transportation": [["Existing Community Services/Outside Supports: PUBLIC ASSISTANCE/SSI;TRANSPORTATION Transportation comment: Mom does not drive. Mom's niece does not live nearby, but drives Mom places she needs to go.", "social need"]], "Childcare": [], "SubstanceAbuse": [], "Safety": [["Mom then discussed that while the home has two floors, they both stay in the living room on the first floor due to not being able to carry Yaribeth up the stairs, and for Mom to utilize the steps herself.", "social need"]], "Permanency": [["Patient living situation: PARENT(S);RELATIVE(S);OTHER Parent Information: Yaribeth lives with her mother in Trenton, NJ.", "no social need"]]}