{"Employment": [["Father- Kelman Josue Alvisurez-Ibarra lives in Michigan due to work obligations (construction) but visits with family often.", "no social need"]], "Housing": [["Mother to utilize RMH shuttle while staying locally.", "social need"]], "Food": [], "Financial": [["Resource Needs Problem(s) LOCAL ACCOMODATIONS;INSURANCE;TRANSPORTATION Goal - Insurance Family will obtain NJMA for the baby. Intervention/Plan - Insurance Family worked with FHCP prenatally and mother currently has CHOP Financial Assistance in place.", "social need"]], "Transportation": [["Parent Information: Mother- Yanci Carrera Corado (20yo) resides with her sister in Bound Brook, NJ approx 1.5 hrs from CHOP. Father- Kelman Josue Alvisurez-Ibarra lives in Michigan due to work obligations (construction) but visits with family often.", "social need"], ["Parent Stressors Adjustment to fetal diagnosis and hospitalization, limited support system, father residing in another state, family was planning to move to Indiana prior to receiving fetal diagnosis and treatment plan", "social need"], ["Parent Strengths Mother's sister is a strong support, father able to travel in for all fetal appts and will arrive again on Friday, family is open to psychosocial support", "no social need"], ["Intervention/Plan - Transportation Father has car, mother does not have access to a car when father is out of state.", "no social need"], ["Intervention/Plan - Transportation Father has car, mother does not have access to a car when father is out of state.", "social need"], ["Goal- Transportation Family will access available resources to assist with transportation including Modivcare for outpatient appointments.", "social need"], ["Fetal Heart SW assisted with Lyft via Cardiac Fund for some prenatal needs. Mother to utilize RMH shuttle while staying locally.", "social need"]], "Childcare": [], "SubstanceAbuse": [], "Safety": [], "Permanency": [["Patient living situation: PARENT(S);CHILDREN IN THE HOME", "no social need"]]}