{"Employment": [["PatientCaregiver_Unemployment", "Mother is a stay at home parent. Father is currently on unpaid leave from his job as a local truck driver.", "no social need"], ["PatientCaregiver_Unemployment", "Parent Stressors Critical illness, prolonged NICU hospitalization, transfer to CHOP, siblings and mother are currently home in Oregon, financial resource strain due to father being on unpaid leave from work.", "no social need"]], "Housing": [["NeedTemporaryLodging", "Father is currently staying at Ronald McDonald House on Chestnut Street.", "social need"]], "Food": [["LackofFundsforFood", "Food insecurity YES Food insecurity comment: Family moved about 3 weesk ago to a new residence. The family is approved for SNAP benefits. Parents are in the process of having their SNAP benefits changed to their new address. At this time, the familis is currently not receiving SNAP benefits.", "social need"], ["LackofFundsforFood", "Existing Community Services/Outside Supports: PUBLIC ASSISTANCE/SSI Public assistance/SSI comment: Family is eligible for SNAP benefits. Family is working have have SNAP benefits transferred to their new address.", "social need"], ["LackofFundsforFood", "Goal - Access to food Family will have their SNAP benefits resume. Intervention/Plan - Access to food Family is approved for SNAP benefits. Parents are working to have their benefits transferred to their new home address (family moved three weeks ago).", "social need"]], "Financial": [["FinancialStrain_Other", "Parent Stressors Critical illness, prolonged NICU hospitalization, transfer to CHOP, siblings and mother are currently home in Oregon, financial resource strain due to father being on unpaid leave from work.", "social need"], ["LackofInsurance", "Hunter has Care Oregon insurance (Oregon Medicaid) and parents have a flex fund through Oregon Medicaid.", "no social need"], ["FinancialStrain_Other", "Resource Needs Problem: HOUSEHOLD FINANCES;ACCESS TO FOOD Goal - Household Finances Family will have financial assistance to support themselves during Hunter's prolonged NICU stay. Intervention/Plan - Household Finances Provided information about SSI and the SSI application process. Father plans to apply. Will email father SSI application instructions. Provided information about the Colette Louise Tisdahl Foundation and the Opens Doors Foundation for financial assistance. Father in agreement with referrals.", "social need"]], "Transportation": [["DistancefromHospital", "Parent Information: Hunter is the fourth child born to his intact parents, Clint and Erica, who live together in Aloha, Oregon.", "social need"], ["DistancefromHospital", "Parent Stressors Critical illness, prolonged NICU hospitalization, transfer to CHOP, siblings and mother are currently home in Oregon, financial resource strain due to father being on unpaid leave from work.", "social need"]], "Childcare": [], "SubstanceAbuse": [], "Safety": [["HomeSafety", "Father shared that the family has a history of Oregon DHS involvement several years ago wherein Hunter's older siblings were removed from parents' care for about one year. Father reports that the family was reunified about a year and a half ago.", "social need"]], "Permanency": [["NonPermanentPlacement", "Patient living situation: PARENT(S);CHILDREN IN THE HOME Parent Information: Hunter is the fourth child born to his intact parents, Clint and Erica, who live together in Aloha, Oregon.", "no social need"]]}