{"Employment": [], "Housing": [], "Food": [], "Financial": [["FinancialStrain_Other", "Mom discussed ongoing financial stressors and that she has become unable to afford gas to come and see Yaseen. SW offered to look into available resources to help Mom with gas money.", "social need"], ["FinancialStrain_Other", "SW also discussed ODF for mortgage assistance. Mom and SW completed the application together. SW will submit the application on the family's behalf. Mom shared about an overdue electric bill that SW Amanda from Montgomery County organization is trying to help the family with.", "social need"], ["FinancialStrain_Other", "Amanda confirmed that she is helping Mom with the Electric Bill (around $1,500). Amanda applied to KAD but was denied due to no available funds. Amanda also applied to Cadcom (Montgomery County Utility Assistance), but has not heard back yet", "social need"], ["FinancialStrain_Other", "Plan: SW will reach out to SW Supervisor regarding resources for gas.", "social need"], ["LackofInsurance", "SW called Insurance CM Nicole Snyder (215-937-8839).", "no social need"]], "Transportation": [], "Childcare": [["ChildcareBarrierfromHospitalization", "Mom discussed ongoing financial stressors and that she has become unable to afford gas to come and see Yaseen. SW offered to look into available resources to help Mom with gas money. Mom is getting surgery on 11/3, but plans to come visit on 11/2, as well as the back and forth travel today.", "social need"], ["NeedofChildcare", "Mom also discussed disposition planning for Yaseen. Mom clarified that she will be bed-ridden for 2 weeks post surgery (until 11/17), but her doctor also informed her mobility and activity should be extremely limited until 2 months post-surgery (1/3/2023). Thus, mom will not be able to care for Yaseen until 1/23/2022. Mom discussed that she has been approved for 10 hours overnight (9pm-7am) and Yaseen will be in school from 7am-3pm, but Mom will need that 3-9pm shift covered by nursing during her recovery time. Mom expressed that there is no one else who can care for Yaseen, or help her. Mom identified a neighbor who is a nurse, but she is only able to stop by for a short amount of time, not for hours at a time. SW to speak with CM and the care team regarding this nursing support needed.", "social need"], ["NeedofChildcare", "Mom expressed gratitude to SW and how challenging this preparation for her surgery has been, as she is the only one who cares for Yaseen and she does not have local family support. Mom expressed that she wants Yaseen to be cared for safely while she is unable to.", "social need"], ["NeedofChildcare", "Amanda suggested Firely Medical Daycare in Harleysville, PA for after school care, given that even if nurses are staffed, they could call out last minute and Mom would be unable to care for him.", "social need"]], "SubstanceAbuse": [], "Safety": [["CommunityAccessibility", "Addendum 2pm: SW spoke with Amanda Synder (610-755-9479) who is the Intermediate Unit Coordinator through North Penn School District. Amanda discussed that Yaseen has not been to school in several years due to no nursing staffed in the school and issues with his stroller. Per Amanda, stroller issues have been resolved. Amanda discussed that staffing was available, but then he was admitted to the hospital, so she is unsure if that staffing is still available. Amanda requested a tentative discharge date so she can check on staffing.", "social need"], ["CommunityAccessibility", "SW called Insurance CM Nicole Snyder (215-937-8839). KF CM discussed that she spoke with Mom that it would be best to defer the ramp and stair lift to another time due to Mom's surgery and several of the steps will require her help and presence.", "social need"]], "Permanency": []}