{"Employment": [["PatientCaregiver_Unemployment", "Dad does not currently work.", "social need"], ["PatientCaregiver_Unemployment", "Mom works at Newark Airport.", "no social need"], ["PatientCaregiver_Unemployment", "Mom is currently getting Unemployment benefits ($200/month) due to being on job furlough.", "no social need"]], "Housing": [["HouseInstability_Other", "Goal - Housing Family will have access to Philadephia resources to potentially relocate here through PHA. Intervention/Plan- Housing SW will research local resources and applying for public housing in Philadelphia.", "social need"], ["HouseInstability_Other", "Mom shared that she is interested in moving to Philadelphia and would like support with applying for Public Housing here. SW offered to look into resources to assist Mom with getting connected to Public Housing.", "social need"], ["HouseInstability_Other", "Plan: SW to look into housing resources and support resources for the family.", "social need"]], "Food": [["LackofFundsforFood", "Public assistance/SSI comment: Mom receives SNAP benefits- she currently receives $98/month, but reached out this month to add her children to her account, so is hopeful she will receive more.", "no social need"], ["FoodInsecurity_Other", "Goal - Access to food Family will have access to food during this admission. Intervention/Plan - Access to food SW will continue to approve meal vouchers through the SWEF.", "social need"]], "Financial": [["FinancialStrain_Other", "Mom is currently getting Unemployment benefits ($200/month) due to being on job furlough.", "social need"], ["FinancialStrain_Other", "Resource Needs Problem: HOUSING;HOUSEHOLD FINANCES;ACCESS TO FOOD;EMPLOYMENT/INCOME Goal - Household Finances Family will have support with household finances during this admission. Intervention/Plan - Household Finances SW discussed applying for rental assistance with Mom", "social need"], ["FinancialStrain_Other", "Goal - Access to food Family will have access to food during this admission. Intervention/Plan - Access to food SW will continue to approve meal vouchers through the SWEF.", "social need"], ["FinancialStrain_Other", "Plan: SW to look into housing resources and support resources for the family. SW will submit J Foundation application once lease is obtained.", "social need"], ["FinancialStrain_Other", "SW and Mom completed the J Foundation application. SW will submit once Mom obtains a copy of their lease from Dad. SW encouraged Mom to give herself grace and time in adjusting to Demarcus's new needs.", "social need"], ["FinancialStrain_Other", "SW discussed applying for foundation financial assistance to help with financial stressors instead", "social need"], ["FinancialStrain_Other", "Mom again became tearful and shared about the family's financial struggles, especially with rent over the past few months Demarcus has been admitted.", "social need"]], "Transportation": [["LackofTransportation", "Transportation comment: Family has a car.", "no social need"], ["LackofTransportation", "Car is currently broken down.", "social need"], ["LackofTransportation", "Mom shared that the family car is currently broken down, which has made it challenging for Mom and/or Dad to travel back and forth.", "social need"]], "Childcare": [["ChildcareBarrierfromNonHospitalization", "Parent Stressors Demarcus' accident, his new medical needs and baseline and what the future will hold, being away from her kids, limited local support.", "social need"], ["ChildcareBarrierfromHospitalization", "Mom shared that she is remaining at the bedside 24/7, which has been challenging to be away from her other children, but she does not want to leave Demarcus", "social need"], ["ChildcareBarrierfromNonHospitalization", "Mom shared that she is remaining at the bedside 24/7, which has been challenging to be away from her other children, but she does not want to leave Demarcus.", "social need"]], "SubstanceAbuse": [], "Safety": [], "Permanency": [["NonPermanentPlacement", "Patient living situation: PARENT(S);CHILDREN IN THE HOME Parent Information: Pt lives with Mom and Dad in Newark, NJ.", "no social need"]]}