{"Employment": [["PatientCaregiver_Unemployment", "-Parents remain incarcerated and this is projected to be the case for an unknown period", "social need"]], "Housing": [], "Food": [], "Financial": [], "Transportation": [], "Childcare": [["ChildcareBarrierfromHospitalization", "-Parents remain incarcerated and this is projected to be the case for an unknown period", "social need"]], "SubstanceAbuse": [], "Safety": [["HomeEnvironment_Other", "Progress:  LSW has been in contact with CPS workers and Northampton County Prison case workers throughout the last couple days. LSW spoke with Ebony Maxwell of Lehigh County Children and Youth on 6/28/23. The following information was provided: - LSW shared current pertinent information with Ebony as Liliana and parents remain supervised by both Lehigh and Northampton CYS. -Ebony informed LSW that Lehigh county and Northampton county are currently figuring out which county has jurisdiction over this supervised case. -At the time of call LSW informed Ebony that she does not have the whereabouts of parents and confirmed address in chart as last known address. -LSW has not been successful at reaching parents via phone. -LSW informed worker of parents recent visitor restriction. -Ebony verbalized that she is in contact with Tristen Shelton and LSW asked Ebony to have Tristen contact LSW. On 6/28/23 LSW received voice message from Tristen Shelton, Case worker from County of Northampton and upon returning the call on 6/29/23 LSW was unable to make contact with Tristen. LSW informed of parents incarceration on 6/29/23. On 6/29/23 LSW spoke with both Kari Case Case Manager (For patient mother)  and Sheila Bell Case Manager (For patient father) of Northampton County Prison. The following was discussed: -Parents remain incarcerated and this is projected to be the case for an unknown period -LSW provided the CYS workers contacts to the workers -LSW gave a brief synopsis of Liliana`s current state (stable and extubated) -LSW had the workers pass along the message that nursing continues to dress Liliana in the clothing parents brought to CHOP -LSW emailed workers two blank medical authorization forms for parents to complete -Parents looking to have paternal grandmother as medical decision maker for Liliana but will have to complete appropriate documentation with the help of their case workers first -LSW provide with Treatment contact number -610829 7438 to call and register to communicate directly with parents should CHOP require immediate consent for medical reasons", "social need"]], "Permanency": []}