{"Employment": [["Both parents report employment; mother works for Cross Point United Methodist Church while father is employed with Penn State College of Medicine. SW provided both parents with a letter verifying current admission at their request due to anticipated work absence.", "no social need"], ["Parent Strengths Intact family, employed with stable income and adequate resources, active in care needs, easily engaged, supportive at bedside, knowledgeable", "no social need"]], "Housing": [], "Food": [], "Financial": [["Parent Strengths Intact family, employed with stable income and adequate resources, active in care needs, easily engaged, supportive at bedside, knowledgeable", "no social need"], ["Public assistance/SSI comment: PA Medicaid", "no social need"], ["Other existing community services/outside support comment: Cumberland County Adoption Stipend", "no social need"]], "Transportation": [], "Childcare": [["Parent Stressors Jayvon's emergent hospitalization due to negligent care while at Gemma Services, medical status while hospitalized, balancing bedside presence with household obligations, unknown length of admission, placement post discharge", "social need"], ["Parent Stressors Jayvon's emergent hospitalization due to negligent care while at Gemma Services, medical status while hospitalized, balancing bedside presence with household obligations, unknown length of admission, placement post discharge", "social need"]], "SubstanceAbuse": [], "Safety": [["CPS Involvement YES CPS involvment comment: Jayvon was adopted by Michael and Mary Cote on June 14th, 2016 through Cumberland County Children & Youth Services. Per mother’s report, CYS became involved again during May of 2022 at the request of parents due to Jayvon's unsafe behaviors within the home and towards himself. Please note that there were no concerns for parental maltreatment or neglect. Once removed from the residence, Jayvon was placed at Kids Peace in Allentown, PA from June 23rd, 2022 to July 20th, 2022 before being transferred to Gemma Residential Treatment Facility. Cumberland County CYS closed the case in July of 2022 post Jayvon’s RTF placement.", "social need"]], "Permanency": [["Facility Contact: Jayvon presently resides at Gemma Residential Facility, located at 512 West Township Line Road, Plymouth Meeting, Pennsylvania 19462", "social need"], ["Grade Comment: Due to Jayvon being admitted to an RTF, he will either attend Montgomery County IU or Martin Luther School in the fall, which is located on the campus of Gemma Services. He will be in the 4th grade for the 2022-2023 academic year.", "social need"], ["Patient living situation: PARENT(S);CHILDREN IN THE HOME", "no social need"], [";RESIDENTIAL FACILITY;OTHER", "social need"], ["Parent Stressors Jayvon's emergent hospitalization due to negligent care while at Gemma Services, medical status while hospitalized, balancing bedside presence with household obligations, unknown length of admission, placement post discharge", "social need"]]}