{"Employment": [["Father reports employment with Doordash while mother is studying to become a medical assistant", "no social need"], ["Father reports employment with Doordash while mother is studying to become a medical assistant.", "social need"]], "Housing": [["Parent Stressors Language barrier, financial status, very limited family support, distance from home and other children, current insurance barriers, identifying local accommodations independently", "social need"], ["Goal - Local Accommodations Parents requesting assistance with covering the financial obligation for local hotels as they have no child care support in Franklin, NJ Intervention/Plan- Local Accommodations SW connected parents with the family service representative at RMH Chestnut Street location to begin the room request process. RMH is willing to accommodate one parent and the three children, allowing parents to alternate bedside presence.", "social need"]], "Food": [], "Financial": [["Parent Stressors Language barrier, financial status, very limited family support, distance from home and other children, current insurance barriers, identifying local accommodations independently", "social need"], ["Per FHCP, \"because Juan is already insured and CHOP is currently non participating with any of NJMA MCO’s, the patient would not be eligible for consideration under Financial Assistance", "no social need"], ["Existing Community Services/Outside Supports: PUBLIC ASSISTANCE/SSI Public assistance/SSI comment: NJ Medicaid.", "no social need"], ["Patient screened today for concrete resource eligibility: Patient is eligible and Social Work provided the following resources:  Meal Vouchers: 4. Reason for Disbursement: Other hardship considerations: Financial strain", "social need"]], "Transportation": [["Other Information: Juan resides roughly 2 1/2 hours away in Franklin, NJ with his parents and three siblings.", "social need"], ["Parent Stressors Language barrier, financial status, very limited family support, distance from home and other children, current insurance barriers, identifying local accommodations independently", "social need"]], "Childcare": [["Goal - Local Accommodations Parents requesting assistance with covering the financial obligation for local hotels as they have no child care support in Franklin, NJ", "social need"]], "SubstanceAbuse": [], "Safety": [["CPS Involvement YES CPS involvment comment: Parents report previous DCPP involvement due to CHOP employees having suspicions of abandonment. The case as investigated, unfounded and closed. No current DCPP involvement reported at this time.", "social need"]], "Permanency": [["Patient living situation: PARENT(S);CHILDREN IN THE HOME;", "no social need"]]}