{"Employment": [["Parents have both returned to work.", "no social need"]], "Housing": [], "Food": [["Food insecurity YES Food insecurity comment: Family is in the process of applying for WIC benefits.", "social need"], ["Mother applied for WIC benefits.", "social need"], ["Resource Needs Problem: ACCESS TO FOOD;OTHER (SEE COMMENT) Goal - Access to food Family will have WIC benefits. Intervention/Plan - Access to food Social worker will provide a letter of support for mother's in-process WIC application.", "social need"], ["WIC letter of support left at bedside.", "social need"]], "Financial": [["Parents have added Ezra to their employer-sponsored Horizon Blue Cross Blue Shield of NJ insurance plan.", "no social need"], ["Discussed applying for financial assistance to offset the costs associated with Ezra's lengthy initial NICU stay so that parents can spend on a second car seat or other baby care necessities. Mother in agreement with referral to the Colette Louise Tisdahl Foundation. Social worker will submit referral for financial assistance to the Colette Louise Tisdahl Foundation.", "social need"], ["Application submitted to the Colette Louise Tisdahl Foundation for financial assistance.", "social need"]], "Transportation": [], "Childcare": [], "SubstanceAbuse": [], "Safety": [["Goal - Other resource needs Family will have funding to purchase an additional car seat for their second vehicle. Intervention/Plan - Other resource needs Parents have a car seat for Ezra. Mother inquired about receiving an additional car seat for the family's second vehicle. Social worker informed mother that the hospital is not able to provide a second car seat for families who already have a car seat.", "no social need"]], "Permanency": [["Patient living situation: PARENT(S);CHILDREN IN THE HOME Parent Information: Ezra is the fourth child born to his intact parents, Stacy and Derick, who live together in Pleasantville, NJ with Ezra's 5 year old, 11 year ols and 19 year old siblings.", "no social need"]]}