{"Employment": [], "Housing": [], "Food": [], "Financial": [["LackofInsurance", "Existing Community Services/Outside Supports: PUBLIC ASSISTANCE/SSI Public assistance/SSI comment: medicaid insurance", "no social need"]], "Transportation": [], "Childcare": [["NeedofChildcare", "School Status OTHER Other School Status Comment: attends daycare Mondays, Tuesdays and Thursdays", "no social need"]], "SubstanceAbuse": [], "Safety": [["CommunitySafety", "Legal Issues YES Legal Issues comment: Per mother, father has history of legal involvement;  current police investigation due to nature of events leading to child's admission.", "social need"], ["ChildAbuse", "Relationships/Behavior Problems NONE IDENTIFIED;SUSPECTED ABUSE/NEGLECT ntervention/Plan - Suspected abuse/neglect There are no SW concerns for child abuse and neglect identified at this time; will continue to follow.", "no social need"], ["CommunitySafety", "Mother states pitbull must have gotten upstairs because father told mother he heard Honesty crying, friend yelling for father to come down, and barking.  Father informed mother he saw Honesty 'laying there' and the second dog came up and jumped on her again.", "social need"], ["CommunitySafety", "Mother is unsure about the two dogs' vaccination status.  Mother states the detectives took father and his friend's cell phones, however father calls hourly and mother will request vaccination status and date of vaccination if known.", "social need"]], "Permanency": [["NonPermanentPlacement", "Patient living situation: PARENT(S);", "no social need"], ["NonPermanentPlacement", "Other Information: Honesty spends time with father, Jamil Johnson.  Father lives in home with paternal grandparents, paternal uncle (12 or 13 yo), paternal aunt (26yo)", "no social need"], ["NonPermanentPlacement", "Honesty lives at home with mother, and occasionally her 26 yo maternal uncle.  Honesty spends time with father who resides at home with paternal grandparents, minor aged paternal uncle and adult aged paternal aunt.", "no social need"]]}