{"Employment": [], "Housing": [["NeedTemporaryLodging", "Goal - Local Accommodations Family will have information about local accommodations and NICU parent sleep rooms. Intervention/Plan- Local Accommodations Mother is familiar with the NICU parent sleep room request process. Provided information about Ronald McDonald House. Mother is interested in checking in to Ronald McDonald House on Saturday 10/22/22. Social worker submitted Ronald McDonald House referral", "social need"], ["NeedTemporaryLodging", "Referral made to the Ronald McDonald House on Chestnut Street for a desired check-in of 10/22/22", "social need"]], "Food": [], "Financial": [["LackofInsurance", "Existing Community Services/Outside Supports: PUBLIC ASSISTANCE/SSI Public assistance/SSI comment: Mother has already added Ah'sani to her Horizon NJ Health insurance.", "no social need"], ["FinancialStrain_Other", "Mother is receiving SNAP and WIC benefits.", "no social need"], ["FinancialStrain_Other", "Resource Needs Problem: LOCAL ACCOMODATIONS;ACCESS TO FOOD Goal - Access to food Family will have access to food while Ah'sani is hospitalized in the CHOP NICU. Intervention/Plan - Access to food Meal vouchers provided as mother has limited income at the moment and is over an hour from home.", "social need"], ["FinancialStrain_Other", ". Meal vouchers provided as mother is far from home and there is financial resource strain.", "social need"], ["FinancialStrain_Other", "Patient screened today for concrete resource eligibility: Patient is eligible and Social Work provided the following resources:  Meal Vouchers: 4", "social need"]], "Transportation": [["DistancefromHospital", "Parent Information: Ah'sani will live with her mother, Kiyana, in Atlantic City, NJ (about an hour and 15 minutes from CHOP).", "social need"], ["DistancefromHospital", "Parent Stressors Unanticipated ICU-level hospitalization, history of a prior loss, history of a child who was hospitalized in the NICU and the associated emotional triggers, mother lives over an hour from CHOP.", "social need"], ["DistancefromHospital", "ntervention/Plan - Access to food Meal vouchers provided as mother has limited income at the moment and is over an hour from home.", "social need"], ["DistancefromHospital", "Meal vouchers provided as mother is far from home and there is financial resource strain.", "social need"]], "Childcare": [], "SubstanceAbuse": [], "Safety": [], "Permanency": [["NonPermanentPlacement", "Patient living situation: PARENT(S) Parent Information: Ah'sani will live with her mother, Kiyana, in Atlantic City, NJ (about an hour and 15 minutes from CHOP).", "no social need"]]}