{"Employment": [["PatientCaregiver_Unemployment", "Father works in construction and is currently taking unpaid time off from work. Mother runs a pet sitting business and also works for a property management company. She is also taking unpaid time off from work.", "no social need"], ["PatientCaregiver_Unemployment", "Goal - Employment/income Parents will have information to apply for NJ Disability and Paid Family Leave. Intervention/Plan - Employment/income Social worker provided information about the NJ Disability and Paid Family Leave programs. Parents plan to apply. Social worker emailed parents a link to the online applications. Will provide assistance as needed", "no social need"]], "Housing": [["NeedTemporaryLodging", "Parents are checking in to the Ronald McDonald House on Chestnut Street this evening.", "social need"]], "Food": [], "Financial": [["FinancialStrain_Other", "Resource Needs Problem: EMPLOYMENT/INCOME;HOUSEHOLD FINANCES Goal - Household Finances Rhodes will have active SSI benefits. Intervention/Plan - Household Finances Parents planned to begin the SSI application process when Rhodes was hospitalized at St. Peter's and have not yet begun the application process. Social worker provided information about the application process and offered to support parents with the process as needed. Goal - Employment/income Parents will have information to apply for NJ Disability and Paid Family Leave. Intervention/Plan - Employment/income Social worker provided information about the NJ Disability and Paid Family Leave programs. Parents plan to apply. Social worker emailed parents a link to the online applications. Will provide assistance as needed.", "social need"], ["LackofInsurance", "Mother has Horizon NJ Health NJ Medical Assistance insurance and has already added Rhodes to this insurance.", "no social need"]], "Transportation": [["DistancefromHospital", "Parent Information: Rhodes is the first child born to his intact parents, Brianna and Tate, who live together in Farmingdale, NJ (about 90 minutes from CHOP).", "social need"]], "Childcare": [], "SubstanceAbuse": [], "Safety": [], "Permanency": [["NonPermanentPlacement", "Patient living situation: PARENT(S) Parent Information: Rhodes is the first child born to his intact parents, Brianna and Tate, who live together in Farmingdale, NJ (about 90 minutes from CHOP).", "no social need"]]}