{"Employment": [["PatientCaregiver_Unemployment", "Karine is unemployed and father, Kesnel, recently started working for Coca-cola.", "social need"], ["PatientCaregiver_Unemployment", "Karine is unemployed and father, Kesnel, recently started working for Coca-cola.", "no social need"]], "Housing": [["GeneralHousingInstability", "Housing instability YES Housing instability comment: Per mom, the family pays month-to-month for their housing arrangement and does not have a formal lease.", "social need"], ["NeedTemporaryLodging", "Goal - Local Accommodations SW added mom to RMH waitlist and provided information on facility Intervention/Plan- Local Accommodations Provide information on RMH and assist mom with lodging plan", "social need"]], "Food": [], "Financial": [["FinancialStrain_Other", "Karine receives monetary support from her aunt.", "social need"], ["FinancialStrain_Other", "Food insecurity YES Food insecurity comment: Per mom, the family faces significant financial strain and has difficulty affording basic needs.", "social need"], ["FinancialStrain_Other", "Parent Stressors Language barrier, temporary protected status, financial strain, distance from home to hospital", "social need"], ["LackofInsurance", "Existing Community Services/Outside Supports: PUBLIC ASSISTANCE/SSI Public assistance/SSI comment: Family is enrolled in NJMA, SW is assisting family in applying for SSI.", "no social need"], ["FinancialStrain_Other", "Resource Needs Problem: HOUSEHOLD FINANCES;TRANSPORTATION;LOCAL ACCOMODATIONS Goal - Household Finances SW will continue to support family in accessing appropriate financial resources Intervention/Plan - Household Finances SW will assist mom in applying for SSI and connecting to local immigration agencies to provide access to eligible resources", "social need"]], "Transportation": [["LackofTransportation", "Nhoam's cousin also lives in the home and supports the family with transport.", "social need"], ["DistancefromHospital", "Karine has a 13 y/o son that remains in Haiti.", "social need"], ["DistancefromHospital", "Parent Stressors Language barrier, temporary protected status, financial strain, distance from home to hospital", "social need"], ["LackofTransportation", "Goal- Transportation SW confirmed with NJ Modivcare that pt is enrolled, will coach mom on how to use service Intervention/Plan - Transportation T/b with NJ Modivcare to assist in enrolling pt in services for reliable transport for medical apts", "social need"]], "Childcare": [["ChildcareBarrierfromNonHospitalization", "Karine has a 13 y/o son that remains in Haiti.", "social need"]], "SubstanceAbuse": [], "Safety": [], "Permanency": [["NonPermanentPlacement", "Patient living situation: PARENT(S) Parent Information: Nhoam lives in Hamilton, NJ in a rented room in a house with his mother, Karine.", "no social need"], ["NonPermanentPlacement", "Nhoam's father is involved but does not currently live with Nhoam and mom, he does live in the local area.", "no social need"]]}