{"Employment": [["PatientCaregiver_Unemployment", "Dad owns his own business in construction/contracting and mom stays at home with William and siblings.", "no social need"]], "Housing": [["GeneralHousingInstability", "Legal Guardian Strengths Stable housing and income, supportive family, knowledge of resources, presenting as engaged with pt's care needs at bedside", "no social need"], ["NeedTemporaryLodging", "Resource Needs Problem: LOCAL ACCOMODATIONS Goal - Local Accommodations SW will continue to support family with accomodations as needed Intervention/Plan- Local Accommodations Family has checked into local RMH.", "social need"], ["NeedTemporaryLodging", "Heather shared that the family has checked into local RMH, though are anticipating checking out soon so Thomas (adoptive father) can bring home 8yo sibling, who is reportedly struggling with transition to stay at RMH.", "social need"]], "Food": [], "Financial": [["FinancialStrain_Other", "Legal Guardian Strengths Stable housing and income, supportive family, knowledge of resources, presenting as engaged with pt's care needs at bedside", "no social need"], ["LackofInsurance", "Public assistance/SSI comment: Pt is active on PAMA, family is aware of WIC/other state-based supports", "no social need"]], "Transportation": [["DistancefromHospital", "Parent Information: Patient lives with adoptive parents Heather and Thomas Umstead in Linden, PA, approximately 3.5 hours from CHOP.", "social need"], ["DistancefromHospital", "Legal Guardian Stressors Adopted child with significant medical needs, other young children in the home, single income, distance from CHOP", "social need"]], "Childcare": [], "SubstanceAbuse": [], "Safety": [], "Permanency": [["NonPermanentPlacement", "Patient living situation: PARENT(S);CHILDREN IN THE HOME Parent Information: Patient lives with adoptive parents Heather and Thomas Umstead in Linden, PA, approximately 3.5 hours from CHOP.", "no social need"], ["PermanentPlacementPending", "Existing Community Services/Outside Supports: CHILDREN AND YOUTH AGENCY/CUA;PUBLIC ASSISTANCE/SSI Children and youth agency/CUA comment: Family reports close contact with adoption caseworker in Indiana who continues to support family through finalization of adoption process", "social need"]]}